examples/dot/sweep_with_two_parameters.dot
strict digraph "" {
    node [label="\N"];
    "NumericExpression1" [label="0", shape=box];
    "NumericExpression2" [label="1", shape=box];
    "NumericExpression3" [label="5", shape=box];
    "NumericRange1" [label="SteppedRange", shape=box];
    "NumericRange1" -> "NumericExpression1"  [label="InclusiveStart", style=dashed];
    "NumericRange1" -> "NumericExpression2"  [label="Step", style=dashed];
    "NumericRange1" -> "NumericExpression3"  [label="ExclusiveEnd", style=dashed];
    "NumericParameter1" [label="NumericParameter", shape=box];
    "NumericExpression4" [label="100", shape=box];
    "Port1" [label="Port", shape=box];
    "Port1" -> "NumericExpression4"  [label="Id", style=dashed];
    "Frequency1" [label="5 GHz", shape=box];
    "Radians2" [label="0 rad", shape=box];
    "Frequency3" [label="10 MHz", shape=box];
    "Frame1" [label="Frame", shape=box];
    "Frame1" -> "Port1"  [label="Port", style=dashed];
    "Frame1" -> "Frequency1"  [label="Frequency", style=dashed];
    "Frame1" -> "Radians2"  [label="Phase", style=dashed];
    "Frame1" -> "Frequency3"  [label="IntermediateFrequency", style=dashed];
    "Interval4" [label="100 ns", shape=box];
    "Waveform1" [label="ConstantWaveform", shape=box];
    "Waveform1" -> "Interval4"  [label="Duration", style=dashed];
    "Instruction3" [label="ModulatedPulse", shape=box];
    "Instruction3" -> "Frame1"  [label="Frame", style=dashed];
    "Instruction3" -> "Waveform1"  [label="Envelope", style=dashed];
    "NumericRangeExpression2:Values" [label="0.1, 0.2, 0.3, ..., 0.5", shape=box];
    "NumericRangeExpression2" [label="LiteralNumericRange", shape=box];
    "NumericRangeExpression2" -> "NumericRangeExpression2:Values"  [label="Values", style=dashed];
    "NumericExpression5" [label="NumericRangeElement", shape=box];
    "NumericExpression5" -> "NumericRangeExpression2"  [label="Source", style=dashed];
    "NumericExpression5" -> "NumericParameter1"  [label="Index", style=dashed];
    "Amplitude5" [label="Amplitude", shape=box];
    "Amplitude5" -> "NumericExpression5"  [label="Value", style=dashed];
    "Instruction3" -> "Amplitude5"  [label="Amplitude", style=dashed];
    "NumericExpression6" [label="200", shape=box];
    "Port2" [label="Port", shape=box];
    "Port2" -> "NumericExpression6"  [label="Id", style=dashed];
    "Frequency6" [label="7 GHz", shape=box];
    "Radians7" [label="0 rad", shape=box];
    "Frequency8" [label="20 MHz", shape=box];
    "Frame2" [label="Frame", shape=box];
    "Frame2" -> "Port2"  [label="Port", style=dashed];
    "Frame2" -> "Frequency6"  [label="Frequency", style=dashed];
    "Frame2" -> "Radians7"  [label="Phase", style=dashed];
    "Frame2" -> "Frequency8"  [label="IntermediateFrequency", style=dashed];
    "Interval9" [label="100 ns", shape=box];
    "Waveform2" [label="ConstantWaveform", shape=box];
    "Waveform2" -> "Interval9"  [label="Duration", style=dashed];
    "Instruction4" [label="ModulatedPulse", shape=box];
    "Instruction4" -> "Frame2"  [label="Frame", style=dashed];
    "Instruction4" -> "Waveform2"  [label="Envelope", style=dashed];
    "NumericRangeExpression3:Values" [label="0.5, 0.4, 0.3, ..., 0.1", shape=box];
    "NumericRangeExpression3" [label="LiteralNumericRange", shape=box];
    "NumericRangeExpression3" -> "NumericRangeExpression3:Values"  [label="Values", style=dashed];
    "NumericExpression7" [label="NumericRangeElement", shape=box];
    "NumericExpression7" -> "NumericRangeExpression3"  [label="Source", style=dashed];
    "NumericExpression7" -> "NumericParameter1"  [label="Index", style=dashed];
    "Amplitude10" [label="Amplitude", shape=box];
    "Amplitude10" -> "NumericExpression7"  [label="Value", style=dashed];
    "Instruction4" -> "Amplitude10"  [label="Amplitude", style=dashed];
    "Instruction5:Alignment" [label="StartToStart", shape=box];
    "Instruction5:Relationship" [label="InstructionRelationship", shape=box];
    "Instruction5:Relationship" -> "Instruction5:Alignment"  [label="Alignment", style=dashed];
    "Instruction5" [label="Dependency", shape=box];
    "Instruction5" -> "Instruction5:Relationship"  [label="Relationship", style=dashed];
    "Instruction5" -> "Instruction3"  [label="Lhs", style=dashed];
    "Instruction5" -> "Instruction4"  [label="Rhs", style=dashed];
    "Instruction6:Alignment" [label="EndToStart", shape=box];
    "Instruction6:Relationship" [label="InstructionRelationship", shape=box];
    "Instruction6:Relationship" -> "Instruction6:Alignment"  [label="Alignment", style=dashed];
    "Function7" [label="Function", shape=box];
    "Function7" -> "NumericParameter1"  [label="Parameter", style=dashed];
    "Function7" -> "Instruction5"  [label="Body1", style=dashed];
    "Instruction6" [label="ForEachNumeric", shape=box];
    "Instruction6" -> "NumericRange1"  [label="Source", style=dashed];
    "Instruction6" -> "Instruction6:Relationship"  [label="Relationship", style=dashed];
    "Instruction6" -> "Function7"  [label="Body", style=dashed];
    "Job" [label="Job", shape=box];
    "Job" -> "Instruction6"  [label="EntryPoint1", style=dashed];
}
